#version: 0.2
G V
S N
I A
V L
F N
S F
T N
L L
T Q
L Q
L P
K N
S A
L D
I T
A G
V N
S V
S K
G K
T E
V F
S S
G D
F G
L T
T K
Q T
S G
D L
A A
L N
L V
R V
P F
I D
S Y
I K
E V
I Y
I R
A D
I G
V T
A Q
I C
S C
Y N
Y V
R D
Y F
R F
T F
A Y
S E
L K
S Q
I N
G T
N C
S L
E N
Q Y
Y S
T V
F T
L H
G F
FN G
VN N
A I
T D
Q P
G Y
S TE
D V
S I
G N
T P
A R
S P
K F
K Q
I P
E P
V E
I Q
P G
Y T
K C
L C
VL Y
I LP
C L
R L
K E
C V
LD K
W N
L IA
L GK
SS VL
K S
T A
LP F
E D
L M
YN Y
SA N
W F
SC C
D P
F VF
LQ P
R K
P A
D C
TN V
A V
F C
VL P
W T
R E
LT P
I VNN
AG AA
A SV
N D
SG WT
LD SK
FNG LT
IA D
L S
SN N
T R
G FN
V SG
P C
Y Y
AI H
R R
RV YS
Y GV
X X
E K
GV YY
SN K
P L
R SY
GV K
P LL
GV NC
H A
I SG
I V
L E
N F
V S
F P
D LP
I GV
Q D
G R
M Y
I SV
H T
F V
V A
N Q
SF G
A LN
Q L
Q I
C F
RD I
D D
G Q
T SN
I W
N I
G SF
P Q
M Q
LQ I
E C
LQ S
E M
A EV
ID RL
W P
P V
I SN
Q Q
SF I
PG TN
KN KC
M SE
S IA
MQ M
QD KN
GSF C
AEV Q
YNY K
TQ R
MSE C
VL GQ
FG AI
D FC
F SQ
SA LL
I M
T W
TQ N
IT GR
TN LV
SA P
MQM AY
D IP
LV KQ
K IY
FN K
LDK VE
IT PC
RV V
RD P
GV SV
VA VLY
LQS LQ
Q K
QL IR
QQ FG
NF Y
IT PGTN
QT R
TV Y
VN FN
IK WP
GY H
FV SN
T SV
SF PQ
LN E
H GV
E VF
D K
AA E
SF V
TN LC
C C
LQI PF
RV DFC
FGAI SSVL
LN DL
MSEC VLGQ
Y AD
YT M
YF KN
T YV
TQR NFY
L AA
H D
H FP
T G
LDKVE AEVQ
IY K
VT L
IC GD
KNKC VNFN
ILP VS
RDP QT
MQMAY R
VLY EN
Y IW
AG IC
ITGR LQSLQ
A LT
Q VAVLY
TD EM
GSFC TQ
SFG GVSV
FNG IGV
GV FVSN
TF E
V KQ
TSV DC
NQ FN
KS TNLV
SFPQ SAP
EV A
SIA IP
VF R
KIY SK
KC YGV
G YF
SFV IR
ALN T
GK GYH
QLIR AAE
A SY
ND I
SK RVDFC
LH YT
SAN LAA
IA G
N AQ
LPF QQFG
P IK
KF D
I LD
HGV VF
RF P
QY T
LTP TW
Y E
LQIPF A
A E
LNE SL
VT YV
LNDL CF
TQN VLYEN
IY Q
IAD YNYK
TE ILPVS
LDKVEAEVQ IDRL
FSQ ILP
P DK
GD CL
FN A
YFKN HT
ITPGTN TSN
IA YTM
W I
VE QDKN
LVKQ LS
STE C
SGWT FG
ITPC SFGGVSV
AV RDPQT
NI TNLC
ISV T
EP LV
T MY
R LN
FGAISSVL NDI
ITGRLQSLQ TYV
TE V
R SFI
IA WN
VF QTR
N TF
YAD SFVIR
FVF KN
QYT SALL
SNN SIAIP
MQMAYR FNGIGV
FNK VTL
TQRNFY EP
EVF AQ
HFP RE
ISN CV
GV L
MSECVLGQ SKRVDFC
GVFVSN GT
Y A
E RDI
PDK VFR
LNDLCF TNV
Q LTPTW
FT G
QY IKWP
KSTNLV KNKCVNFN
VKQ IYK
EC DIP
V IG
ISG IN
IQ KE
VLP PLL
TQ QLIRAAE
LGK LQ
GYF KIYSK
VNN SY
IT D
VT IM
C G
LM SFPQSAP
AGIC ASY
TEILPVS M
SNK KF
GVK LHYT
R ALT
STEC SN
IA VEQDKN
LIA NQFN
AG CL
I GK
ED LL
KE E
KN L
H TP
IA QYTSALL
P K
AG F
FNKVTL AD
RFP NITNLC
NAQ ALNT
LQ Y
HGVVF LH
ITPGTNTSN QVAVLY
IC HD
TQNVLYEN QK
T T
TMY ICGD
TA SA
LK PF
P AQ
LL LQY
RLN EVA
LQP E
RVV VL
CV IAWN
ISNCV AD
IADYNYK LP
EV FNA
KCYGV SP
IAYTM SL
SF TR
QY GDCL
IAG LIA
GK A
IG IN
IVNN TVY
VLPPLL TDEM
Q GF
YIW L
NC TFE
QLTPTW RVYS
MSECVLGQSKRVDFC GKGYH
ILD ITPCSFGGVSV
FVFKN ID
TQ EVFAQ
QI IT
TQQLIRAAE IR
TK TSVDC
LPFQQFG RD
QP Y
SF E
LDKVEAEVQIDRL ITGRLQSLQTYV
LQIPFA MQMAYRFNGIGV
SF KEE
SA IGK
GVL TE
IG AE
SK RSFI
IQKE ID
AR SV
TG SN
C VN
IT SGWTFG
LK G
CG PK
IT RF
LLLQY GSFCTQ
YE QYIKWP
AGF IK
ISVT TEILPVSM
DV VIG
LNDLCFTNV YADSFVIR
LC C
SCC SC
LDK YFKNHT
RALT G
H WF
SQ SI
VTYV PAQ
AY SNNSIAIP
IQ D
DD FTG
AG T
LKPF ERDI
KCYGVSP TK
HFPRE GVFVSNGT
VFQTR AGCL
A LD
TQNVLYENQK LIANQFN
EPLV DLP
QYGDCL GD
RL F
NAQALNT LVKQLS
PG QT
F LPF
VNNSY ECDIP
ASV YA
M FVF
G IY
IG AGICASY
GYFKIYSK HTP
TP PIK
PDKVFR SSVL
K GVKLHYT
AIH AD
F SN
F KNL
DL GD
FG GFN
LMSFPQSAP HGVVFLH
LNESL ID
STE IYQ
TMYICGD STECSN
CC SC
TQRNFYEP QIIT
EDLL FNKVTLAD
QT SN
IR G
SI V
PL SE
RVVVL SFE
M T
VN IQKEID
TQEVFAQ VKQIYK
AVRDPQT LE
VL LP
ICHD GKA
SK P
E LGK
SCC KFD
TASA LGKLQ
VLPPLLTDEM IAQYTSALL
YF A
CGPK KSTNLVKNKCVNFN
SNKKF LPFQQFGRD
SAN NCTFE
A SANLAA
IADYNYKLP DDFTG
H S
ILDITPCSFGGVSV ITPGTNTSNQVAVLY
AGAA LQIPFAMQMAYRFNGIGV
VTIM LCC
IGIN ITRF
RLF RK
RALTG IAVEQDKN
QTSN F
D SE
TEV PV
GT GVLTE
YV GY
SFTR GVYY
FSQILP DP
FT ISVTTEILPVSM
RK R
DVVIG IVNNTVY
IA PGQT
YN EN
LDKVEAEVQIDRLITGRLQSLQTYV TQQLIRAAEIR
TA PA
LKG CCSC
SQSI IAYTMSL
ASVYA WN
E F
QLTPTWRVYS TGSN
VT WF
FN D
DP LQPE
ALD PLSE
SQ PF
IQD SL
I IRG
YIWL GF
WI FG
DLGD ISGIN
LNESLID LQ
IAGLIA IV
VSG NC
LL HA
M E
GN FKNL
SFKEE LDKYFKNHT
DL IC
SIV RFPNITNLC
VFQTRAGCL IGAE
VNIQKEID RLNEVA
R TF
TQNVLYENQKLIANQFN SAIGK
YS VL
N KS
FVFKNID GYFKIYSKHTP
GV YFA
E KN
QP TE
IADYNYKLPDDFTG CVIAWN
SKRSFI EDLLFNKVTLAD
KCYGVSPTK LNDLCFTNVYADSFVIR
AGT ITSGWTFG
V IK
HFPREGVFVSNGT HWF
G SCCKFD
AGFIK QYGDCLGD
FLPF FSN
TV CGPKKSTNLVKNKCVNFN
MSECVLGQSKRVDFCGKGYH LMSFPQSAPHGVVFLH
YSVL YN
QPY RVVVLSFE
C T
TKTSVDC TMYICGDSTECSN
LKPFERDI STEIYQ
DLIC AQ
GIY QTSNF
LV SS
MT SCCSC
V C
PDKVFRSSVL HS
LL K
EKN FT
IGINITRF QT
SP DV
NTF VSGNC
ARSV A
VNNSYECDIP IGAGICASY
RKR ISNCVAD
ELGK YEQYIKWP
YNEN GT
IAGLIAIV M
G A
LK SF
TEVPV AIHAD
TQEVFAQVKQIYK TPPIK
EVFNA T
TN G
LH RSY
YVGY LQP
SANNCTFE YV
AVRDPQTLE ILDITPCSFGGVSVITPGTNTSNQVAVLY
LVSS Q
SS TASALGKLQ
T TD
WIFG TT
LP QGF
GA EN
FND GVYFA
LL A
FGGFN FSQILPDP
AV DC
LM DL
LDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIR ASANLAA
ED DSE
GIYQTSNF RV
LKPFERDISTEIYQ AG
VC EF
GTGVLTE SNKKFLPFQQFGRD
TKTSVDCTMYICGDSTECSN LLLQYGSFCTQ
TQ S
EPLVDLP IGINITRFQT
MSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLH VTYVPAQ
A TNV
Q FC
TK RF
D N
QPTE SIVRFPNITNLC
SKP SKRSFIEDLLFNKVTLAD
P VLP
ALDPLSE TK
TQ DL
FLPFFSN VTWF
TAPA ICHDGKA
RTF LLK
DVVIGIVNNTVY DPLQPE
LLHA PA
SV AYSNNSIAIP
AGFIKQYGDCLGD IA
VLPPLLTDEMIAQYTSALL AGTITSGWTFG
LKGCCSC GSCCKFD
AGAALQIPFAMQMAYRFNGIGV TQNVLYENQKLIANQFNSAIGK
LVSSQ CVN
SN IIRG
KN LNESLIDLQ
QLTPTWRVYSTGSN VFQTRAGCLIGAE
TV EK
CT LKSF
W YIWLGF
SFTRGVYY PDKVFRSSVLHS
ARSVA SQSIIAYTMSL
GVNC TEVPVAIHAD
YNENGT ITD
LD SFKEELDKYFKNHT
TQS LL
VTIMLCC MTSCCSC
Y RLFRK
Q TQ
AR DLICAQ
VIK VCEF
AY YVGYLQP
ASVYAWN RKRISNCVAD
SPDV DLGDISGIN
RALTGIAVEQDKN TQEVFAQVKQIYKTPPIK
SANNCTFEYV SQPF
E GK
IQDSL SSTASALGKLQ
LLA LHRSY
FTISVTTEILPVSM TKTSVDCTMYICGDSTECSNLLLQYGSFCTQ
LLHAPA TVCGPKKSTNLVKNKCVNFN
VLLP LVSSQCVN
V TQRNFYEPQIIT
GD SS
TNG TKRF
PVLP FNDGVYFA
TAPAICHDGKA HFPREGVFVSNGTHWF
K FNGLT
MSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQ EKNFT
VNIQKEIDRLNEVA KNLNESLIDLQ
AVDC ALDPLSETK
TTD AVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLY
NTFVSGNC DVVIGIVNNTVYDPLQPE
TQSLL IVNN
GIYQTSNFRV QPTESIVRFPNITNLC
SNIIRG WIFGTT
EGK Q
TN SFTRGVYYPDKVFRSSVLHS
KN NKS
VIKVCEF QFC
TQDL FLPFFSNVTWF
WYIWLGF IAGLIAIVM
GNFKNL RE
FGGFNFSQILPDP SKPSKRSFIEDLLFNKVTLAD
RTFLLK YNENGTITD
ASVYAWNRKRISNCVAD YSVLYN
CTLKSF TVEK
GAEN SVAYSNNSIAIP
LKGCCSCGSCCKFD EDDSE
VNNSYECDIPIGAGICASY QTQ
QPYRVVVLSFE LLHAPATVCGPKKSTNLVKNKCVNFN
AGFIKQYGDCLGDIA ARDLICAQ
W ME
Q GVNCTEVPVAIHAD
N GV
P VL
FNGLT GTGVLTESNKKFLPFQQFGRD
VLPPLLTDEMIAQYTSALLAGTITSGWTFG AGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGK
AGAA AYYVGYLQP
SANNCTFEYVSQPF LMDL
MFVF L
RD LPQGF
EPLVDLPIGINITRFQT LLALHRSY
TQSLLIVNN ATNV
LDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAA TK
VNIQKEIDRLNEVAKNLNESLIDLQ ELGKYEQYIKWP
TNGTKRF DN
LDSFKEELDKYFKNHT SPDVDLGDISGIN
H KNNKS
GNFKNLRE FVFKNIDGYFKIYSKHTP
PVL KGVKLHYT
LTP GDSS
C YF
ND PF
GN YNY
EVFNAT RF
SN LKPFERDISTEIYQAG
WYIWLGFIAGLIAIVM VTIMLCCMTSCCSC
ARSVASQSIIAYTMSL GAENSVAYSNNSIAIP
QGVNCTEVPVAIHAD QLTPTWRVYSTGSNVFQTRAGCLIGAE
TAPAICHDGKAHFPREGVFVSNGTHWF VTQRNFYEPQIIT
HKNNKS WME
SNIIRGWIFGTT LDSK
AVDCALDPLSETK CTLKSFTVEK
LDSK V
TQDLFLPFFSNVTWF H
G GNYNY
VLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGK IQDSLSSTASALGKLQ
MFVFL VLLPLVSSQCVN
AGFIKQYGDCLGDIAARDLICAQ KFNGLT
SANNCTFEYVSQPFLMDL EGKQ
TQSLLIVNNATNV VIKVCEFQFC
AGAAAYYVGYLQP RTFLLKYNENGTITD
ASV VNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWP
TNGTKRFDN PVLPFNDGVYFA
YRLFRK SNLKPFERDISTEIYQAG
LDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATK MSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFT
EVFNATRF ASVYAWNRKRISNCVADYSVLYN
QPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFN FNGLTGTGVLTESNKKFLPFQQFGRD
LDSKV GGNYNY
NTFVSGNCDVVIGIVNNTVYDPLQPE LDSFKEELDKYFKNHTSPDVDLGDISGIN
LKGCCSCGSCCKFDEDDSE PVLKGVKLHYT
GNFKNLREFVFKNIDGYFKIYSKHTP IN
AVDCALDPLSETKCTLKSFTVEK GIYQTSNFRVQPTESIVRFPNITNLC
TTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLY QGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAE
LTPGDSS SGWT
TNSFTRGVYYPDKVFRSSVLHS TQDLFLPFFSNVTWFH
SA L
FGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLAD AGFIKQYGDCLGDIAARDLICAQKFNGLT
LQ SY
P LQSY
PLQSY GF
TQSLLIVNNATNVVIKVCEFQFC NDPF
ASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWP WYIWLGFIAGLIAIVMVTIMLCCMTSCCSC
EPLVDLPIGINITRFQTLLALHRSY LTPGDSSSGWT
LDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFT TAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIIT
Q IAPGQT
EV R
TQ LP
AGAAAYYVGYLQPRTFLLKYNENGTITD AVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC
RDLPQGF SAL
EVR QIAPGQT
SANNCTFEYVSQPFLMDLEGKQ GNFKNLREFVFKNIDGYFKIYSKHTPIN
TF KCYGVSPTKLNDLCFTNVYADSFVIR
GD EVRQIAPGQT
LS R
SNIIRGWIFGTTLDSK TQSLLIVNNATNVVIKVCEFQFCNDPF
FGAISSVLNDI LSR
TN FTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ
CYF PLQSYGF
SF S
P FG
IADYNYKLPDDFTGCVIAWN SNN
VN Q
TFKCYGVSPTKLNDLCFTNVYADSFVIR GDEVRQIAPGQT
SA SFS
FGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLT VLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQ
NAQALNTLVKQLS SN
VNQ NAQALNTLVKQLSSN
P AY
GFN CYFPLQSYGF
TQLP PAY
LN RALTGIAVEQDKNTQEVFAQVKQIYKTPPIK
IADYNYKLPDDFTGCVIAWNSNN LDSKVGGNYNY
GFNCYFPLQSYGF QP
SASFS TFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQT
PFG EVFNATRFASVYAWNRKRISNCVADYSVLYN
PC NGV
LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIK D
VNNSYECDIPIGAGICASYQTQ TN
NTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGIN ASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSC
TR TQLPPAY
QPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRD IAD
ARSVASQSIIAYTMSLGAENSVAYSNNSIAIP TNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ
PFGEVFNATRFASVYAWNRKRISNCVADYSVLYN SASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQT
AIH VSG
GK IADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNY
E GFNCYFPLQSYGFQP
H VNNSYECDIPIGAGICASYQTQTN
HVNNSYECDIPIGAGICASYQTQTN S
EPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWT AGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC
MFVFLVLLPLVSSQCVN L
SANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPIN LV
LDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIIT TD
NTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSC LKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
PFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQT GKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNY
TNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFH AIHVSG
QPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIAD TTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAE
FGAISSVLNDILSR LDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTD
STE K
LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKD FGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQ
TNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSG TNGTKRFDNPVLPFNDGVYFA
R YRLFRKSNLKPFERDISTEIYQAG
TN GV
RR R
TNGV GY
RDLPQGFSAL EPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC
SK PCNGV
V VNQNAQALNTLVKQLSSN
EGFNCYFPLQSYGFQP TNGVGY
R TRTQLPPAY
RYRLFRKSNLKPFERDISTEIYQAG SKPCNGV
HKNNKSWME S
HVNNSYECDIPIGAGICASYQTQTNS RRR
GV YS
RYRLFRKSNLKPFERDISTEIYQAGSKPCNGV EGFNCYFPLQSYGFQPTNGVGY
HKNNKSWMES GVYS
N VVNQNAQALNTLVKQLSSN
MFVFLVLLPLVSSQCVNL RTRTQLPPAY
HVNNSYECDIPIGAGICASYQTQTNSRRR ARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ
V YY
STEK SNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPF
PFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNY RYRLFRKSNLKPFERDISTEIYQAGSKPCNGVEGFNCYFPLQSYGFQPTNGVGY
FGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTD NTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
HKNNKSWMESGVYS SANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLV
LD VYY
QPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAE HVNNSYECDIPIGAGICASYQTQTNSRRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ
LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQ NVVNQNAQALNTLVKQLSSN
MFVFLVLLPLVSSQCVNLRTRTQLPPAY TNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSGTNGTKRFDNPVLPFNDGVYFA
PFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNYRYRLFRKSNLKPFERDISTEIYQAGSKPCNGVEGFNCYFPLQSYGFQPTNGVGY QPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAEHVNNSYECDIPIGAGICASYQTQTNSRRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ
XX XX
SE F
T YGV
SEF RVYS
HKNNKSWMESGVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLV RDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC
HKNNKSWME SEFRVYS
STEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPF LDVYY
H RR
SI EK
LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQNVVNQNAQALNTLVKQLSSN FGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTDNTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
F A
L YRLFRKSNLKPFERDISTEIYQAG
SIEK SNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPF
STEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPF L
DV VNQNAQALNTLVKQLSSN
TP C
S TPC
TYGV GY
LYRLFRKSNLKPFERDISTEIYQAG STPC
HKNNKSWMESGVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLVRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC PFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNYRYRLFRKSNLKPFERDISTEIYQAGSKPCNGVEGFNCYFPLQSYGFQPTNGVGYQPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAEHVNNSYECDIPIGAGICASYQTQTNSRRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ
N K
DV VN
S HRR
DVVN H
NAQALNTLVKQLS SK
MFVFLVLLPLVSSQCVNLRTRTQLPPAYTNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSGTNGTKRFDNPVLPFNDGVYFA SIEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPF
SG TNGTKRFDNPVLPFNDGVYFA
DVVNH NAQALNTLVKQLSSK
G H
LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQ DVVNQNAQALNTLVKQLSSN
R P
LT TRTQLPPAY
VNNSYECDIPIGAGICASYQTQ TK
TYGV GH
RP TYGVGH
Y VNNSYECDIPIGAGICASYQTQTK
NK PCNGV
LK RALTGIAVEQDKNTQEVFAQVKQIYKTPPIK
LKRALTGIAVEQDKNTQEVFAQVKQIYKTPPIK Y
YVNNSYECDIPIGAGICASYQTQTK SHRR
XX X
MFVFLVLLPLVSSQCVN LTTRTQLPPAY
HKNNKSWMESEFRVYS SANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLV
GN IADYNYKLPDDFTGCVIAWN
F KCYGVSPTKLNDLCFTNVYADSFVIR
T H
TNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFH AI
PF FA
FKCYGVSPTKLNDLCFTNVYADSFVIR GN
FGAISSVLNDI L
LYRLFRKSNLKPFERDISTEIYQAGSTPC NGV
IT R
ARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ LKRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKY
ID D
FGAISSVLNDIL AR
GNIADYNYKLPDDFTGCVIAWN SNK
PFFA FKCYGVSPTKLNDLCFTNVYADSFVIRGN
PF D
L G
IN FTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ
PFFAFKCYGVSPTKLNDLCFTNVYADSFVIRGN EV
EGFNCYFPLQSYGFQP TYGVGY
HVNNSYECDIPIGAGICASYQTQTNS HRR
SQ IAPGQT
QPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRD IDD
FGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQ DVVNHNAQALNTLVKQLSSK
MFVFLVLLPLVSSQCVNL ITR
TNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAI SGTNGTKRFDNPVLPFNDGVYFA
GV Y
NKPCNGV AG
LDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIIT TH
YVNNSYECDIPIGAGICASYQTQTKSHRR ARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQLKRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKY
LYRLFRKSNLKPFERDISTEIYQAGSTPCNGV EGFNCYFPLQSYGFQPTYGVGY
ARSVASQSIIAYTMSLGAENSVAYSNNSIAIP INFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ
MFVFLVLLPLVSSQCVNLRTRTQLPPAYTNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSGTNGTKRFDNPVLPFNDGVYFA STEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPFLDVYY
FGAISSVLNDILAR LDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTH
RPTYGVGH QPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAE
PFFAFKCYGVSPTKLNDLCFTNVYADSFVIRGNEV SQIAPGQT
L GVYY
HVNNSYECDIPIGAGICASYQTQTNSHRR ARSVASQSIIAYTMSLGAENSVAYSNNSIAIPINFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ
LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQNVVNQNAQALNTLVKQLSSN FGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTD
LYRLFRKSNLKPFERDISTEIYQAGSTPCNGVEGFNCYFPLQSYGFQPTYGVGY QPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIDD
MFVFLVLLPLVSSQCVNLITR TQ
FA PFFAFKCYGVSPTKLNDLCFTNVYADSFVIRGNEVSQIAPGQT
TNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSGTNGTKRFDNPVLPFNDGVYFA STEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPFLDVYY
PFD EVFNATRFASVYAWNRKRISNCVADYSVLYN
NKPCNGVAG FN
PFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNY LYRLFRKSNLKPFERDISTEIYQAGSTPCNGVEGFNCYFPLQSYGFQPTYGVGYQPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIDD
STEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPFL GVY
TTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAE HVNNSYECDIPIGAGICASYQTQTNSHRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPINFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ
SANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPIN LG
HKNNKSWMESGVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLV RDLPQGFSAL
CYF PL
CYFPL RSY
LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQDVVNQNAQALNTLVKQLSSN FGAISSVLNDILARLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTH
STEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPFL GVYY
YVNNSYECDIPIGAGICASYQTQTKSHRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQLKRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKY FGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQDVVNHNAQALNTLVKQLSSK
MFVFLVLLPLVSSQCVNLITRTQ SY
HKNNKSWMESEFRVYS SANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLG
MFVFLVLLPLVSSQCVNLRTRTQLPPAYTNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSGTNGTKRFDNPVLPFNDGVYFASIEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPF LDVYY
NKPCNGVAGFN CYFPLRSY
MFVFLVLLPLVSSQCVNLTTRTQLPPAY TNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAISGTNGTKRFDNPVLPFNDGVYFA
S VL
FAPFFAFKCYGVSPTKLNDLCFTNVYADSFVIRGNEVSQIAPGQT GNIADYNYKLPDDFTGCVIAWNSNK
PFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNYRYRLFRKSNLKPFERDISTEIYQAGSKPCNGVEGFNCYFPLQSYGFQPTNGVGYQPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAEHVNNSYECDIPIGAGICASYQTQTNSRRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQNVVNQNAQALNTLVKQLSSNFGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTDNTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
HKNNKSWMESEFRVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLV RDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC
RDLPQGF SVL
HKNNKSWMESGVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLVRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC PFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNYRYRLFRKSNLKPFERDISTEIYQAGSKPCNGVEGFNCYFPLQSYGFQPTNGVGY
RDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC PFDEVFNATRFASVYAWNRKRISNCVADYSVLYN
LYRLFRKSNLKPFERDISTEIYQAG NKPCNGVAGFNCYFPLRSY
RPTYGVGHQPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAE YVNNSYECDIPIGAGICASYQTQTKSHRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQLKRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKYFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQDVVNHNAQALNTLVKQLSSK
NVVNQNAQALNTLVKQLSSN FGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTDNTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
PFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNYLYRLFRKSNLKPFERDISTEIYQAGSTPCNGVEGFNCYFPLQSYGFQPTYGVGYQPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIDD TTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAEHVNNSYECDIPIGAGICASYQTQTNSHRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPINFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ
LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQDVVNQNAQALNTLVKQLSSNFGAISSVLNDILARLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTH NTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
TD NTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
MFVFLVLLPLVSSQCVNLTTRTQLPPAYTNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAISGTNGTKRFDNPVLPFNDGVYFA STEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPFLGVY
HKNNKSWMESGVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLV RDLPQGFSVL
LV RDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC
LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQNVVNQNAQALNTLVKQLSSN FGAISSVLNDILSR
HKNNKSWMESEFRVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLG RDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLCPFDEVFNATRFASVYAWNRKRISNCVADYSVLYN
STEK SNIIRGWIFGTTLDSK
ASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSC LKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
WYIWLGFIAGLIAIVMVTIMLCCMTSCCSC LKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
FAPFFAFKCYGVSPTKLNDLCFTNVYADSFVIRGNEVSQIAPGQTGNIADYNYKLPDDFTGCVIAWNSNK LDSKVGGNYNY
L X
LYRLFRKSNLKPFERDISTEIYQAGNKPCNGVAGFNCYFPLRSY GF
IAD TTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAE
EPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWT AGAAAYYVGYLQPRTFLLKYNENGTITD
MFVFLVLLPLVSSQCVNLITRTQSY TNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSGTNGTKRFDNPVLPFNDGVYFASTEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPFLDVYY
MFVFLVLLPLVSSQCVNLRTRTQLPPAYTNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSGTNGTKRFDNPVLPFNDGVYFA STEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPFLGVYY
LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKD FGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLT
AIHVSG TNGTKRFDNPVLPFNDGVYFA
HKNNKSWMESGVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLVRDLPQGFSVL EPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC
NTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGIN ASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWP
QPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAEHVNNSYECDIPIGAGICASYQTQTNSRRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQNVVNQNAQALNTLVKQLSSNFGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTDNTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
RPTYGVGHQPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAEYVNNSYECDIPIGAGICASYQTQTKSHRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQLKRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKYFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQDVVNHNAQALNTLVKQLSSK FGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTDNTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
SANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLV RDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC
X VVNQNAQALNTLVKQLSSN
XXXX XXXX
N YNY
HVNNSYECDIPIGAGICASYQTQTNSRRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQNVVNQNAQALNTLVKQLSSNFGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTDNTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
HKNNKSWMESGVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLVRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLCPFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNYRYRLFRKSNLKPFERDISTEIYQAGSKPCNGVEGFNCYFPLQSYGFQPTNGVGYQPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAEHVNNSYECDIPIGAGICASYQTQTNSRRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQNVVNQNAQALNTLVKQLSSNFGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTDNTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
RDLPQGFSAL EPLVDLPIGINITRFQTLLALHRSY
QPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIAD TTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLY
LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKD FGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLAD
HKNNKSWMESEFRVYS SANNCTFEYVSQPFLMDLEGKQ
L RTRTQLPPAY
MSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFT TAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIIT
SIEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPF LDVYY
SP RR
NTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGIN ASV
V YS
LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQ XVVNQNAQALNTLVKQLSSN
HKNNKSWMESEFRVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLGRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLCPFDEVFNATRFASVYAWNRKRISNCVADYSVLYN FAPFFAFKCYGVSPTKLNDLCFTNVYADSFVIRGNEVSQIAPGQTGNIADYNYKLPDDFTGCVIAWNSNKLDSKVGGNYNY
HKNNKSWMESGVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLVRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLCPFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNYRYRLFRKSNLKPFERDISTEIYQAGSKPCNGVEGFNCYFPLQSYGFQPTNGVGY QPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAE
TQSLLIVNNATNVVIKVCEFQFC N
VLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQ NVVNQNAQALNTLVKQLSSNFGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTDNTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
MFVFLVLLPLVSSQCVNLRTRTQLPPAY TNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSG
GNFKNLREFVFKNIDGYFKIYSKHTPIN LVRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC
PFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNYRYRLFRKSNLKPFERDISTEIYQAGSKPCNGVEGFNCYFPLQSYGFQPTNGVGYQPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAEHVNNSYECDIPIGAGICASYQTQTNSRRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQNVVNQNAQALNTLVKQLSSNFGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTD
LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQNVVNQNAQALNTLVKQLSSNFGAISSVLNDILSR LDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFT
NTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSC LKGCCSCGSCCKFDEDDSE
PFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNYLYRLFRKSNLKPFERDISTEIYQAGSTPCNGVEGFNCYFPLQSYGFQPTYGVGYQPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIDDTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAEHVNNSYECDIPIGAGICASYQTQTNSHRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPINFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQDVVNQNAQALNTLVKQLSSNFGAISSVLNDILARLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTHNTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
EVFNAT TF
GKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNY RYRLFRKSNLKPFERDISTEIYQAGSKPCNGVEGFNCYFPLQSYGFQPTNGVGY
N GVK
SK LKPFERDISTEIYQAG
RRR ARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ
NGVK GFNCYFPLQSYGFQP
SGWT AGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC
FVFKNIDGYFKIYSKHTP IN
HKNNKSWMESGVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLVRDLPQGFSAL EPLVDLPIGINITRFQTLLALHRSY
HKNNKSWMESGVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLVRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLCPFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNYRYRLFRKSNLKPFERDISTEIYQAGSKPCNGVEGFNCYFPLQSYGFQPTNGVGYQPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAEHVNNSYECDIPIGAGICASYQTQTNSRRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQNVVNQNAQALNTLVKQLSSNFGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTD
HKNNKSWMESGVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLVRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC PFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNY
VIKVCEFQFC NDPF
LTPGDSSSGWT AGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC
MFVFLVLLPLVSSQCVNLTTRTQLPPAYTNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAISGTNGTKRFDNPVLPFNDGVYFASTEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPFLGVY HKNNKSWMESEFRVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLVRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC
MFVFLVLLPLVSSQCVNLRTRTQLPPAYTNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSGTNGTKRFDNPVLPFNDGVYFASIEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPF LGVYY
YRLFRK SKLKPFERDISTEIYQAG
VTIMLCCMTSCCSC LKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
NGVKGFNCYFPLQSYGFQP TYGVGY
HKNNKSWMESEFRVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLV RDLPQGFSAL
LDSK VSG
V Y
LDSKVSG NYNY
MFVF F
LYRLFRKSNLKPFERDISTEIYQAGSTPC NGVKGFNCYFPLQSYGFQPTYGVGY
S RRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ
XXX VYS
S X
MFVFF VLLPLVSSQCVN
STEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPFL X
YF PLQSYGF
LX VYY
STEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPFLX VYY
PLL KGVKLHYT
XXXX X
MFVFLVLLPLVSSQCVN F
HKNNKSWMES XXXVYS
A GVNC
A SF
Y VNNSYECDIPIGAGICASYQTQTN
STEKSNIIRGWIFGTTLDSK TQSLLIVNNATNVVIKVCEFQFCN
AGVNC YFPLQSYGF
MFVFLVLLPLVSSQCVNLRTRTQLPPAY TNSFTRGVYYPDKVFRSSVLHS
WT AGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC
IADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNY LYRLFRKSNLKPFERDISTEIYQAGSTPCNGVKGFNCYFPLQSYGFQPTYGVGY
MFVFLVLLPLVSSQCVNLRTRTQLPPAYTNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSGTNGTKRFDNPVLPFNDGVYFA SIEK
SA Y
NKPCNGV AGVNCYFPLQSYGF
SAL EPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC
TQLP SAY
ASF VNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWP
RTFLLKYNENGTITD AVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC
FNGLTGTGVLTESNKKFLPFQQFGRD IADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAE
ELGKYEQYIKWP WYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
PF H
R TR
F S
MSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIIT TD
EPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWT AGAAAYYVGYLQP
H AIHVSGTNGTKRFDNPVLPFNDGVYFA
LDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAA IK
LDSFKEELDKYFKNHTSPDVDLGDISGIN ASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQXVVNQNAQALNTLVKQLSSN FGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTDNTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
PFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNYRYRLFRKSNLKPFERDISTEIYQAGSKPCNGVEGFNCYFPLQSYGFQPTNGVGY QPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAE
L A
LD VY
TN SRRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ
PF LGVYY
TQDLFLPFFSNVTWF HA
VLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQ DVVNHNAQALNTLVKQLSSK
QPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFN FNG
NTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGIN ASFVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWP
DN PVLPFNDGVYFA
LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQDVVNQNAQALNTLVKQLSSN FGAISSVLNDILSR
TN R
PFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQT GK
MFVFLVLLPLVSSQCVNLRTRTQLPPAYTNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSGTNGTKRFDNPVLPFNDGVYFA STEK
RDLPQGFSALEPLVDLPIGINITRFQTLLALHRSY LTPGDSS
TQDLFLPFFSNVTWFH AIHVSGTNGTKRFDNPVLPFNDGVYFA
SPRR ARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ
CTLKSFTVEK GIYQTSNFRVQPTESIVRFPNITNLC
HKNNKSWMESGVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLVRDLPQGFSAL EPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITD
LMDL EGKQ
GNFKNL SE
FVFKNIDGYFKIYSKHTPIN LVRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC
MFVFLVLLPLVSSQCVNLRTRTQLPPAYTNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSGTNGTKRFDNPVLPFNDGVYFA STEKSNIIRGWIFGTTLDSK
STEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCN Y
LRTRTQLPPAY TNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSGTNGTKRFDNPVLPFNDGVYFA
TNR TQLPSAY
N N
IADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNYLYRLFRKSNLKPFERDISTEIYQAGSTPCNGVKGFNCYFPLQSYGFQPTYGVGY QPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAE
NTFVSGNCDVVIGIVNNTVYDPLQPE LDSFKEELDKYFKNHT
HKNNKSWMESEFRVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLGRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLCPFDEVFNATRFASVYAWNRKRISNCVADYSVLYNFAPFFAFKCYGVSPTKLNDLCFTNVYADSFVIRGNEVSQIAPGQTGNIADYNYKLPDDFTGCVIAWNSNKLDSKVGGNYNY LYRLFRKSNLKPFERDISTEIYQAGNKPCNGVAGFNCYFPLRSYGF
PFH EVFNATTF
XXXX XX
NTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSE PLLKGVKLHYT
LDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAAIK MSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTD
TQSLLIVNNATNVVIKVCEFQFCNDPF LDVYY
ATNV VIKVCEFQFCNDPF
PFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQT GT
G LT
NTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASFVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWP WYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
TNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFH V
FGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQDVVNHNAQALNTLVKQLSSK FGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTDNTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
MFVFLVLLPLVSSQCVNF TNRTQLPSAY
HKNNKSWMESEFRVYSSANNCTFEYVSQPFLMDLEGKQ GNFKNLSE
STEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNY PFLGVYY
R ME
VTQRNFYEPQIIT TDNTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
SNIIRGWIFGTT LD
AGFIKQYGDCLGDIAARDLICAQ KF
TNSFTRGVYYPDKVFRSSVLHS TQDLFLPFFSNVTWFHA
ISG TNGTKRFDNPVLPFNDGVYFA
GTGVLTESNKKFLPFQQFGRD IADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAE
NVVNQNAQALNTLVKQLSSN FGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTD
RPTYGVGHQPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAEYVNNSYECDIPIGAGICASYQTQTKSHRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQLKRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKYFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQDVVNHNAQALNTLVKQLSSK FGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTD
H VNNSYECDIPIGAGICASY
LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLT VLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGK
MFVFLVLLPLVSSQCVNLTTRTQLPPAYTNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAISGTNGTKRFDNPVLPFNDGVYFASTEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPFLGVY HKNNKSWMESEFRVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLVRDLPQGFSAL
DVVNQNAQALNTLVKQLSSN FGAISSVLNDILARLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTH
ARSVASQSIIAYTMSLGAENSVAYSNNSIAIP TN
LDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTD NTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
L YRLFRKSKLKPFERDISTEIYQAG
PF F
RPTYGVGHQPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAE YVNNSYECDIPIGAGICASYQTQTKSHRR
RYRLFRKSNLKPFERDISTEIYQAG NKPCNGVAGVNCYFPLQSYGF
AGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGK IQDSLSSTASALGKLQ
STEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPFLGVY HKNNKSWMESEFRVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLVRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC
QPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNG LK
MFVFLVLLPLVSSQCVNFTNRTQLPSAY TNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSGTNGTKRFDNPVLPFNDGVYFA
SE L
LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQDVVNQNAQALNTLVKQLSSN FGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTDNTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
D FGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQ
MFVFLVLLPLVSSQCVNLRTRTQLPPAYTNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSGTNGTKRFDNPVLPFNDGVYFASIEK SNIIRGWIFGTTLDSK
SEL RVYS
SKPCNGV EGFNCYFPLQSYGFQPTNGVGY
LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQNVVNQNAQALNTLVKQLSSNFGAISSVLNDILSR LDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATK
NTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWP WYIWLGFIAGLIAIVM
FGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLAD AGFIKQYGDCLGDIAARDLICAQKF
L TQRNFYEPQIIT
ARSVASQSIIAYTMSL GAEN
IAGLIAIVM VTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
MFVFL VLLP
HKNNKSWMESGVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLVRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLCPFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNYRYRLFRKSNLKPFERDISTEIYQAGSKPCNGVEGFNCYFPLQSYGFQPTNGVGYQPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAE HVNNSYECDIPIGAGICASYQTQTNSRRR
NTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASV VNIQKEIDRLNEVA
VSG TNGTKRFDNPVLPFNDGVYFA
TAPAICHDGKAHFPREGVFVSNGTHWF LTQRNFYEPQIIT
K GLT
FS R
FGAISSVLNDI FSR
SANNCTFEYVSQPFLMDLEGKQ GNFKNLREFVFKNIDGYFKIYSKHTP
SPDVDLGDISGIN ASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
PFGEVFNATRFASVYAWNRKRISNCVADYSVLYN SASFS
H EN
HEN NKS
LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQDVVNQNAQALNTLVKQLSSNFGAISSVLNDILSR LDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAAIKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTD
YVNNSYECDIPIGAGICASYQTQTN SPRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ
QPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLK GTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAE
STEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNYPFLGVYY HKNNKSWMESEFRVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLSE
MFVFLVLLPLVSSQCVNL RTR
XXX SGTNGTKRFDNPVLPFNDGVYFA
EDDSE PVLKGVKLHYT
SS WTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC
FGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKF KGLT
LDSKVGGNYNY LYRLFRKSNLKPFERDISTEIYQAGNKPCNGVAGFNCYFPLRSYGF
PFG EVFNATRF
HKNNKSWMESXXXVYS SANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLVRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC
RME SELRVYS
GAENSVAYSNNSIAIP TNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ
MFVFLVLLPLVSSQCVNLRTRTQLPPAYTNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSGTNGTKRFDNPVLPFNDGVYFA STEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPFLXVYY
SASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQT GKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNYRYRLFRKSNLKPFERDISTEIYQAGSKPCNGVEGFNCYFPLQSYGFQPTNGVGY
EKNFT TAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIIT
LA PFF
YS PLQSYGF
LDVY H
A N
HENNKS RMESELRVYS
DVVNQNAQALNTLVKQLSSNFGAISSVLNDILARLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTH NTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
VN LG
WIFGTT LDSK
FVFKNIDGYFKIYSKHTPINLVRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC PFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGT
VLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQDVVNHNAQALNTLVKQLSSK FGAISSVLNDIFSR
GDSS SGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC
SF RPTYGVGH
RDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSS SSWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC
T X
SKPSKRSFIEDLLFNKVTLAD AGFIKQYGDCLGDIAARDLICAQKFNGLT
G X
KFNGLT VLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQNVVNQNAQALNTLVKQLSSNFGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTDNTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT
I X
LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLT VLPPLLTDEMIAQYTSALLAGTITSGWTFG
LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKD FGGFNFSQILPDP
YRLFRK SN
L GVY
XXXX XXX
