{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 1280,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 1,
    "pad_type_id": 0,
    "pad_token": "<pad>"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "<mask>",
      "single_word": false,
      "lstrip": true,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "CharDelimiterSplit",
    "delimiter": "\n"
  },
  "post_processor": {
    "type": "RobertaProcessing",
    "sep": [
      "</s>",
      2
    ],
    "cls": [
      "<s>",
      0
    ],
    "trim_offsets": true,
    "add_prefix_space": false
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "<s>": 0,
      "<pad>": 1,
      "</s>": 2,
      "<unk>": 3,
      "<mask>": 4,
      "A": 5,
      "B": 6,
      "C": 7,
      "D": 8,
      "E": 9,
      "F": 10,
      "G": 11,
      "H": 12,
      "I": 13,
      "K": 14,
      "L": 15,
      "M": 16,
      "N": 17,
      "O": 18,
      "P": 19,
      "Q": 20,
      "R": 21,
      "S": 22,
      "T": 23,
      "U": 24,
      "V": 25,
      "W": 26,
      "X": 27,
      "Y": 28,
      "Z": 29,
      "GV": 30,
      "SN": 31,
      "IA": 32,
      "VL": 33,
      "FN": 34,
      "SF": 35,
      "TN": 36,
      "LL": 37,
      "TQ": 38,
      "LQ": 39,
      "LP": 40,
      "KN": 41,
      "SA": 42,
      "LD": 43,
      "IT": 44,
      "AG": 45,
      "VN": 46,
      "SV": 47,
      "SK": 48,
      "GK": 49,
      "TE": 50,
      "VF": 51,
      "SS": 52,
      "GD": 53,
      "FG": 54,
      "LT": 55,
      "TK": 56,
      "QT": 57,
      "SG": 58,
      "DL": 59,
      "AA": 60,
      "LN": 61,
      "LV": 62,
      "RV": 63,
      "PF": 64,
      "ID": 65,
      "SY": 66,
      "IK": 67,
      "EV": 68,
      "IY": 69,
      "IR": 70,
      "AD": 71,
      "IG": 72,
      "VT": 73,
      "AQ": 74,
      "IC": 75,
      "SC": 76,
      "YN": 77,
      "YV": 78,
      "RD": 79,
      "YF": 80,
      "RF": 81,
      "TF": 82,
      "AY": 83,
      "SE": 84,
      "LK": 85,
      "SQ": 86,
      "IN": 87,
      "GT": 88,
      "NC": 89,
      "SL": 90,
      "EN": 91,
      "QY": 92,
      "YS": 93,
      "TV": 94,
      "FT": 95,
      "LH": 96,
      "GF": 97,
      "FNG": 98,
      "VNN": 99,
      "AI": 100,
      "TD": 101,
      "QP": 102,
      "GY": 103,
      "STE": 104,
      "DV": 105,
      "SI": 106,
      "GN": 107,
      "TP": 108,
      "AR": 109,
      "SP": 110,
      "KF": 111,
      "KQ": 112,
      "IP": 113,
      "EP": 114,
      "VE": 115,
      "IQ": 116,
      "PG": 117,
      "YT": 118,
      "KC": 119,
      "LC": 120,
      "VLY": 121,
      "ILP": 122,
      "CL": 123,
      "RL": 124,
      "KE": 125,
      "CV": 126,
      "LDK": 127,
      "WN": 128,
      "LIA": 129,
      "LGK": 130,
      "SSVL": 131,
      "KS": 132,
      "TA": 133,
      "LPF": 134,
      "ED": 135,
      "LM": 136,
      "YNY": 137,
      "SAN": 138,
      "WF": 139,
      "SCC": 140,
      "DP": 141,
      "FVF": 142,
      "LQP": 143,
      "RK": 144,
      "PA": 145,
      "DC": 146,
      "TNV": 147,
      "AV": 148,
      "FC": 149,
      "VLP": 150,
      "WT": 151,
      "RE": 152,
      "LTP": 153,
      "IVNN": 154,
      "AGAA": 155,
      "ASV": 156,
      "ND": 157,
      "SGWT": 158,
      "LDSK": 159,
      "FNGLT": 160,
      "IAD": 161,
      "LS": 162,
      "SNN": 163,
      "TR": 164,
      "GFN": 165,
      "VSG": 166,
      "PC": 167,
      "YY": 168,
      "AIH": 169,
      "RR": 170,
      "RVYS": 171,
      "YGV": 172,
      "XX": 173,
      "EK": 174,
      "GVYY": 175,
      "SNK": 176,
      "PL": 177,
      "RSY": 178,
      "GVK": 179,
      "PLL": 180,
      "GVNC": 181,
      "HA": 182,
      "ISG": 183,
      "IV": 184,
      "LE": 185,
      "NF": 186,
      "VS": 187,
      "FP": 188,
      "DLP": 189,
      "IGV": 190,
      "QD": 191,
      "GR": 192,
      "MY": 193,
      "ISV": 194,
      "HT": 195,
      "FV": 196,
      "VA": 197,
      "NQ": 198,
      "SFG": 199,
      "ALN": 200,
      "QL": 201,
      "QI": 202,
      "CF": 203,
      "RDI": 204,
      "DD": 205,
      "GQ": 206,
      "TSN": 207,
      "IW": 208,
      "NI": 209,
      "GSF": 210,
      "PQ": 211,
      "MQ": 212,
      "LQI": 213,
      "EC": 214,
      "LQS": 215,
      "EM": 216,
      "AEV": 217,
      "IDRL": 218,
      "WP": 219,
      "PV": 220,
      "ISN": 221,
      "QQ": 222,
      "SFI": 223,
      "PGTN": 224,
      "KNKC": 225,
      "MSE": 226,
      "SIA": 227,
      "MQM": 228,
      "QDKN": 229,
      "GSFC": 230,
      "AEVQ": 231,
      "YNYK": 232,
      "TQR": 233,
      "MSEC": 234,
      "VLGQ": 235,
      "FGAI": 236,
      "DFC": 237,
      "FSQ": 238,
      "SALL": 239,
      "IM": 240,
      "TW": 241,
      "TQN": 242,
      "ITGR": 243,
      "TNLV": 244,
      "SAP": 245,
      "MQMAY": 246,
      "DIP": 247,
      "LVKQ": 248,
      "KIY": 249,
      "FNK": 250,
      "LDKVE": 251,
      "ITPC": 252,
      "RVV": 253,
      "RDP": 254,
      "GVSV": 255,
      "VAVLY": 256,
      "LQSLQ": 257,
      "QK": 258,
      "QLIR": 259,
      "QQFG": 260,
      "NFY": 261,
      "ITPGTN": 262,
      "QTR": 263,
      "TVY": 264,
      "VNFN": 265,
      "IKWP": 266,
      "GYH": 267,
      "FVSN": 268,
      "TSV": 269,
      "SFPQ": 270,
      "LNE": 271,
      "HGV": 272,
      "EVF": 273,
      "DK": 274,
      "AAE": 275,
      "SFV": 276,
      "TNLC": 277,
      "CC": 278,
      "LQIPF": 279,
      "RVDFC": 280,
      "FGAISSVL": 281,
      "LNDL": 282,
      "MSECVLGQ": 283,
      "YAD": 284,
      "YTM": 285,
      "YFKN": 286,
      "TYV": 287,
      "TQRNFY": 288,
      "LAA": 289,
      "HD": 290,
      "HFP": 291,
      "TG": 292,
      "LDKVEAEVQ": 293,
      "IYK": 294,
      "VTL": 295,
      "ICGD": 296,
      "KNKCVNFN": 297,
      "ILPVS": 298,
      "RDPQT": 299,
      "MQMAYR": 300,
      "VLYEN": 301,
      "YIW": 302,
      "AGIC": 303,
      "ITGRLQSLQ": 304,
      "ALT": 305,
      "QVAVLY": 306,
      "TDEM": 307,
      "GSFCTQ": 308,
      "SFGGVSV": 309,
      "FNGIGV": 310,
      "GVFVSN": 311,
      "TFE": 312,
      "VKQ": 313,
      "TSVDC": 314,
      "NQFN": 315,
      "KSTNLV": 316,
      "SFPQSAP": 317,
      "EVA": 318,
      "SIAIP": 319,
      "VFR": 320,
      "KIYSK": 321,
      "KCYGV": 322,
      "GYF": 323,
      "SFVIR": 324,
      "ALNT": 325,
      "GKGYH": 326,
      "QLIRAAE": 327,
      "ASY": 328,
      "NDI": 329,
      "SKRVDFC": 330,
      "LHYT": 331,
      "SANLAA": 332,
      "IAG": 333,
      "NAQ": 334,
      "LPFQQFG": 335,
      "PIK": 336,
      "KFD": 337,
      "ILD": 338,
      "HGVVF": 339,
      "RFP": 340,
      "QYT": 341,
      "LTPTW": 342,
      "YE": 343,
      "LQIPFA": 344,
      "AE": 345,
      "LNESL": 346,
      "VTYV": 347,
      "LNDLCF": 348,
      "TQNVLYEN": 349,
      "IYQ": 350,
      "IADYNYK": 351,
      "TEILPVS": 352,
      "LDKVEAEVQIDRL": 353,
      "FSQILP": 354,
      "PDK": 355,
      "GDCL": 356,
      "FNA": 357,
      "YFKNHT": 358,
      "ITPGTNTSN": 359,
      "IAYTM": 360,
      "WI": 361,
      "VEQDKN": 362,
      "LVKQLS": 363,
      "STEC": 364,
      "SGWTFG": 365,
      "ITPCSFGGVSV": 366,
      "AVRDPQT": 367,
      "NITNLC": 368,
      "ISVT": 369,
      "EPLV": 370,
      "TMY": 371,
      "RLN": 372,
      "FGAISSVLNDI": 373,
      "ITGRLQSLQTYV": 374,
      "TEV": 375,
      "RSFI": 376,
      "IAWN": 377,
      "VFQTR": 378,
      "NTF": 379,
      "YADSFVIR": 380,
      "FVFKN": 381,
      "QYTSALL": 382,
      "SNNSIAIP": 383,
      "MQMAYRFNGIGV": 384,
      "FNKVTL": 385,
      "TQRNFYEP": 386,
      "EVFAQ": 387,
      "HFPRE": 388,
      "ISNCV": 389,
      "GVL": 390,
      "MSECVLGQSKRVDFC": 391,
      "GVFVSNGT": 392,
      "YA": 393,
      "ERDI": 394,
      "PDKVFR": 395,
      "LNDLCFTNV": 396,
      "QLTPTW": 397,
      "FTG": 398,
      "QYIKWP": 399,
      "KSTNLVKNKCVNFN": 400,
      "VKQIYK": 401,
      "ECDIP": 402,
      "VIG": 403,
      "ISGIN": 404,
      "IQKE": 405,
      "VLPPLL": 406,
      "TQQLIRAAE": 407,
      "LGKLQ": 408,
      "GYFKIYSK": 409,
      "VNNSY": 410,
      "ITD": 411,
      "VTIM": 412,
      "CG": 413,
      "LMSFPQSAP": 414,
      "AGICASY": 415,
      "TEILPVSM": 416,
      "SNKKF": 417,
      "GVKLHYT": 418,
      "RALT": 419,
      "STECSN": 420,
      "IAVEQDKN": 421,
      "LIANQFN": 422,
      "AGCL": 423,
      "IGK": 424,
      "EDLL": 425,
      "KEE": 426,
      "KNL": 427,
      "HTP": 428,
      "IAQYTSALL": 429,
      "PK": 430,
      "AGF": 431,
      "FNKVTLAD": 432,
      "RFPNITNLC": 433,
      "NAQALNT": 434,
      "LQY": 435,
      "HGVVFLH": 436,
      "ITPGTNTSNQVAVLY": 437,
      "ICHD": 438,
      "TQNVLYENQK": 439,
      "TT": 440,
      "TMYICGD": 441,
      "TASA": 442,
      "LKPF": 443,
      "PAQ": 444,
      "LLLQY": 445,
      "RLNEVA": 446,
      "LQPE": 447,
      "RVVVL": 448,
      "CVIAWN": 449,
      "ISNCVAD": 450,
      "IADYNYKLP": 451,
      "EVFNA": 452,
      "KCYGVSP": 453,
      "IAYTMSL": 454,
      "SFTR": 455,
      "QYGDCL": 456,
      "IAGLIA": 457,
      "GKA": 458,
      "IGIN": 459,
      "IVNNTVY": 460,
      "VLPPLLTDEM": 461,
      "QGF": 462,
      "YIWL": 463,
      "NCTFE": 464,
      "QLTPTWRVYS": 465,
      "MSECVLGQSKRVDFCGKGYH": 466,
      "ILDITPCSFGGVSV": 467,
      "FVFKNID": 468,
      "TQEVFAQ": 469,
      "QIIT": 470,
      "TQQLIRAAEIR": 471,
      "TKTSVDC": 472,
      "LPFQQFGRD": 473,
      "QPY": 474,
      "SFE": 475,
      "LDKVEAEVQIDRLITGRLQSLQTYV": 476,
      "LQIPFAMQMAYRFNGIGV": 477,
      "SFKEE": 478,
      "SAIGK": 479,
      "GVLTE": 480,
      "IGAE": 481,
      "SKRSFI": 482,
      "IQKEID": 483,
      "ARSV": 484,
      "TGSN": 485,
      "CVN": 486,
      "ITSGWTFG": 487,
      "LKG": 488,
      "CGPK": 489,
      "ITRF": 490,
      "LLLQYGSFCTQ": 491,
      "YEQYIKWP": 492,
      "AGFIK": 493,
      "ISVTTEILPVSM": 494,
      "DVVIG": 495,
      "LNDLCFTNVYADSFVIR": 496,
      "LCC": 497,
      "SCCSC": 498,
      "LDKYFKNHT": 499,
      "RALTG": 500,
      "HWF": 501,
      "SQSI": 502,
      "VTYVPAQ": 503,
      "AYSNNSIAIP": 504,
      "IQD": 505,
      "DDFTG": 506,
      "AGT": 507,
      "LKPFERDI": 508,
      "KCYGVSPTK": 509,
      "HFPREGVFVSNGT": 510,
      "VFQTRAGCL": 511,
      "ALD": 512,
      "TQNVLYENQKLIANQFN": 513,
      "EPLVDLP": 514,
      "QYGDCLGD": 515,
      "RLF": 516,
      "NAQALNTLVKQLS": 517,
      "PGQT": 518,
      "FLPF": 519,
      "VNNSYECDIP": 520,
      "ASVYA": 521,
      "MFVF": 522,
      "GIY": 523,
      "IGAGICASY": 524,
      "GYFKIYSKHTP": 525,
      "TPPIK": 526,
      "PDKVFRSSVL": 527,
      "KGVKLHYT": 528,
      "AIHAD": 529,
      "FSN": 530,
      "FKNL": 531,
      "DLGD": 532,
      "FGGFN": 533,
      "LMSFPQSAPHGVVFLH": 534,
      "LNESLID": 535,
      "STEIYQ": 536,
      "TMYICGDSTECSN": 537,
      "CCSC": 538,
      "TQRNFYEPQIIT": 539,
      "EDLLFNKVTLAD": 540,
      "QTSN": 541,
      "IRG": 542,
      "SIV": 543,
      "PLSE": 544,
      "RVVVLSFE": 545,
      "MT": 546,
      "VNIQKEID": 547,
      "TQEVFAQVKQIYK": 548,
      "AVRDPQTLE": 549,
      "VLLP": 550,
      "ICHDGKA": 551,
      "SKP": 552,
      "ELGK": 553,
      "SCCKFD": 554,
      "TASALGKLQ": 555,
      "VLPPLLTDEMIAQYTSALL": 556,
      "YFA": 557,
      "CGPKKSTNLVKNKCVNFN": 558,
      "SNKKFLPFQQFGRD": 559,
      "SANNCTFE": 560,
      "ASANLAA": 561,
      "IADYNYKLPDDFTG": 562,
      "HS": 563,
      "ILDITPCSFGGVSVITPGTNTSNQVAVLY": 564,
      "AGAALQIPFAMQMAYRFNGIGV": 565,
      "VTIMLCC": 566,
      "IGINITRF": 567,
      "RLFRK": 568,
      "RALTGIAVEQDKN": 569,
      "QTSNF": 570,
      "DSE": 571,
      "TEVPV": 572,
      "GTGVLTE": 573,
      "YVGY": 574,
      "SFTRGVYY": 575,
      "FSQILPDP": 576,
      "FTISVTTEILPVSM": 577,
      "RKR": 578,
      "DVVIGIVNNTVY": 579,
      "IAPGQT": 580,
      "YNEN": 581,
      "LDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIR": 582,
      "TAPA": 583,
      "LKGCCSC": 584,
      "SQSIIAYTMSL": 585,
      "ASVYAWN": 586,
      "EF": 587,
      "QLTPTWRVYSTGSN": 588,
      "VTWF": 589,
      "FND": 590,
      "DPLQPE": 591,
      "ALDPLSE": 592,
      "SQPF": 593,
      "IQDSL": 594,
      "IIRG": 595,
      "YIWLGF": 596,
      "WIFG": 597,
      "DLGDISGIN": 598,
      "LNESLIDLQ": 599,
      "IAGLIAIV": 600,
      "VSGNC": 601,
      "LLHA": 602,
      "ME": 603,
      "GNFKNL": 604,
      "SFKEELDKYFKNHT": 605,
      "DLIC": 606,
      "SIVRFPNITNLC": 607,
      "VFQTRAGCLIGAE": 608,
      "VNIQKEIDRLNEVA": 609,
      "RTF": 610,
      "TQNVLYENQKLIANQFNSAIGK": 611,
      "YSVL": 612,
      "NKS": 613,
      "FVFKNIDGYFKIYSKHTP": 614,
      "GVYFA": 615,
      "EKN": 616,
      "QPTE": 617,
      "IADYNYKLPDDFTGCVIAWN": 618,
      "SKRSFIEDLLFNKVTLAD": 619,
      "KCYGVSPTKLNDLCFTNVYADSFVIR": 620,
      "AGTITSGWTFG": 621,
      "VIK": 622,
      "HFPREGVFVSNGTHWF": 623,
      "GSCCKFD": 624,
      "AGFIKQYGDCLGD": 625,
      "FLPFFSN": 626,
      "TVCGPKKSTNLVKNKCVNFN": 627,
      "MSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLH": 628,
      "YSVLYN": 629,
      "QPYRVVVLSFE": 630,
      "CT": 631,
      "TKTSVDCTMYICGDSTECSN": 632,
      "LKPFERDISTEIYQ": 633,
      "DLICAQ": 634,
      "GIYQTSNF": 635,
      "LVSS": 636,
      "MTSCCSC": 637,
      "VC": 638,
      "PDKVFRSSVLHS": 639,
      "LLK": 640,
      "EKNFT": 641,
      "IGINITRFQT": 642,
      "SPDV": 643,
      "NTFVSGNC": 644,
      "ARSVA": 645,
      "VNNSYECDIPIGAGICASY": 646,
      "RKRISNCVAD": 647,
      "ELGKYEQYIKWP": 648,
      "YNENGT": 649,
      "IAGLIAIVM": 650,
      "GA": 651,
      "LKSF": 652,
      "TEVPVAIHAD": 653,
      "TQEVFAQVKQIYKTPPIK": 654,
      "EVFNAT": 655,
      "TNG": 656,
      "LHRSY": 657,
      "YVGYLQP": 658,
      "SANNCTFEYV": 659,
      "AVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLY": 660,
      "LVSSQ": 661,
      "SSTASALGKLQ": 662,
      "TTD": 663,
      "WIFGTT": 664,
      "LPQGF": 665,
      "GAEN": 666,
      "FNDGVYFA": 667,
      "LLA": 668,
      "FGGFNFSQILPDP": 669,
      "AVDC": 670,
      "LMDL": 671,
      "LDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAA": 672,
      "EDDSE": 673,
      "GIYQTSNFRV": 674,
      "LKPFERDISTEIYQAG": 675,
      "VCEF": 676,
      "GTGVLTESNKKFLPFQQFGRD": 677,
      "TKTSVDCTMYICGDSTECSNLLLQYGSFCTQ": 678,
      "TQS": 679,
      "EPLVDLPIGINITRFQT": 680,
      "MSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQ": 681,
      "ATNV": 682,
      "QFC": 683,
      "TKRF": 684,
      "DN": 685,
      "QPTESIVRFPNITNLC": 686,
      "SKPSKRSFIEDLLFNKVTLAD": 687,
      "PVLP": 688,
      "ALDPLSETK": 689,
      "TQDL": 690,
      "FLPFFSNVTWF": 691,
      "TAPAICHDGKA": 692,
      "RTFLLK": 693,
      "DVVIGIVNNTVYDPLQPE": 694,
      "LLHAPA": 695,
      "SVAYSNNSIAIP": 696,
      "AGFIKQYGDCLGDIA": 697,
      "VLPPLLTDEMIAQYTSALLAGTITSGWTFG": 698,
      "LKGCCSCGSCCKFD": 699,
      "AGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGK": 700,
      "LVSSQCVN": 701,
      "SNIIRG": 702,
      "KNLNESLIDLQ": 703,
      "QLTPTWRVYSTGSNVFQTRAGCLIGAE": 704,
      "TVEK": 705,
      "CTLKSF": 706,
      "WYIWLGF": 707,
      "SFTRGVYYPDKVFRSSVLHS": 708,
      "ARSVASQSIIAYTMSL": 709,
      "GVNCTEVPVAIHAD": 710,
      "YNENGTITD": 711,
      "LDSFKEELDKYFKNHT": 712,
      "TQSLL": 713,
      "VTIMLCCMTSCCSC": 714,
      "YRLFRK": 715,
      "QTQ": 716,
      "ARDLICAQ": 717,
      "VIKVCEF": 718,
      "AYYVGYLQP": 719,
      "ASVYAWNRKRISNCVAD": 720,
      "SPDVDLGDISGIN": 721,
      "RALTGIAVEQDKNTQEVFAQVKQIYKTPPIK": 722,
      "SANNCTFEYVSQPF": 723,
      "EGK": 724,
      "IQDSLSSTASALGKLQ": 725,
      "LLALHRSY": 726,
      "FTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ": 727,
      "LLHAPATVCGPKKSTNLVKNKCVNFN": 728,
      "VLLPLVSSQCVN": 729,
      "VTQRNFYEPQIIT": 730,
      "GDSS": 731,
      "TNGTKRF": 732,
      "PVLPFNDGVYFA": 733,
      "TAPAICHDGKAHFPREGVFVSNGTHWF": 734,
      "KFNGLT": 735,
      "MSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFT": 736,
      "VNIQKEIDRLNEVAKNLNESLIDLQ": 737,
      "AVDCALDPLSETK": 738,
      "TTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLY": 739,
      "NTFVSGNCDVVIGIVNNTVYDPLQPE": 740,
      "TQSLLIVNN": 741,
      "GIYQTSNFRVQPTESIVRFPNITNLC": 742,
      "SNIIRGWIFGTT": 743,
      "EGKQ": 744,
      "TNSFTRGVYYPDKVFRSSVLHS": 745,
      "KNNKS": 746,
      "VIKVCEFQFC": 747,
      "TQDLFLPFFSNVTWF": 748,
      "WYIWLGFIAGLIAIVM": 749,
      "GNFKNLRE": 750,
      "FGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLAD": 751,
      "RTFLLKYNENGTITD": 752,
      "ASVYAWNRKRISNCVADYSVLYN": 753,
      "CTLKSFTVEK": 754,
      "GAENSVAYSNNSIAIP": 755,
      "LKGCCSCGSCCKFDEDDSE": 756,
      "VNNSYECDIPIGAGICASYQTQ": 757,
      "QPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFN": 758,
      "AGFIKQYGDCLGDIAARDLICAQ": 759,
      "WME": 760,
      "QGVNCTEVPVAIHAD": 761,
      "NGV": 762,
      "PVL": 763,
      "FNGLTGTGVLTESNKKFLPFQQFGRD": 764,
      "VLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGK": 765,
      "AGAAAYYVGYLQP": 766,
      "SANNCTFEYVSQPFLMDL": 767,
      "MFVFL": 768,
      "RDLPQGF": 769,
      "EPLVDLPIGINITRFQTLLALHRSY": 770,
      "TQSLLIVNNATNV": 771,
      "LDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATK": 772,
      "VNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWP": 773,
      "TNGTKRFDN": 774,
      "LDSFKEELDKYFKNHTSPDVDLGDISGIN": 775,
      "HKNNKS": 776,
      "GNFKNLREFVFKNIDGYFKIYSKHTP": 777,
      "PVLKGVKLHYT": 778,
      "LTPGDSS": 779,
      "CYF": 780,
      "NDPF": 781,
      "GNYNY": 782,
      "EVFNATRF": 783,
      "SNLKPFERDISTEIYQAG": 784,
      "WYIWLGFIAGLIAIVMVTIMLCCMTSCCSC": 785,
      "ARSVASQSIIAYTMSLGAENSVAYSNNSIAIP": 786,
      "QGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAE": 787,
      "TAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIIT": 788,
      "HKNNKSWME": 789,
      "SNIIRGWIFGTTLDSK": 790,
      "AVDCALDPLSETKCTLKSFTVEK": 791,
      "LDSKV": 792,
      "TQDLFLPFFSNVTWFH": 793,
      "GGNYNY": 794,
      "VLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQ": 795,
      "MFVFLVLLPLVSSQCVN": 796,
      "AGFIKQYGDCLGDIAARDLICAQKFNGLT": 797,
      "SANNCTFEYVSQPFLMDLEGKQ": 798,
      "TQSLLIVNNATNVVIKVCEFQFC": 799,
      "AGAAAYYVGYLQPRTFLLKYNENGTITD": 800,
      "ASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWP": 801,
      "TNGTKRFDNPVLPFNDGVYFA": 802,
      "YRLFRKSNLKPFERDISTEIYQAG": 803,
      "LDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFT": 804,
      "EVFNATRFASVYAWNRKRISNCVADYSVLYN": 805,
      "QPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRD": 806,
      "LDSKVGGNYNY": 807,
      "NTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGIN": 808,
      "LKGCCSCGSCCKFDEDDSEPVLKGVKLHYT": 809,
      "GNFKNLREFVFKNIDGYFKIYSKHTPIN": 810,
      "AVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC": 811,
      "TTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAE": 812,
      "LTPGDSSSGWT": 813,
      "TNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFH": 814,
      "SAL": 815,
      "FGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLT": 816,
      "LQSY": 817,
      "PLQSY": 818,
      "PLQSYGF": 819,
      "TQSLLIVNNATNVVIKVCEFQFCNDPF": 820,
      "ASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSC": 821,
      "EPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWT": 822,
      "LDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIIT": 823,
      "QIAPGQT": 824,
      "EVR": 825,
      "TQLP": 826,
      "AGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC": 827,
      "RDLPQGFSAL": 828,
      "EVRQIAPGQT": 829,
      "SANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPIN": 830,
      "TFKCYGVSPTKLNDLCFTNVYADSFVIR": 831,
      "GDEVRQIAPGQT": 832,
      "LSR": 833,
      "SNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPF": 834,
      "FGAISSVLNDILSR": 835,
      "TNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ": 836,
      "CYFPLQSYGF": 837,
      "SFS": 838,
      "PFG": 839,
      "IADYNYKLPDDFTGCVIAWNSNN": 840,
      "VNQ": 841,
      "TFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQT": 842,
      "SASFS": 843,
      "FGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQ": 844,
      "NAQALNTLVKQLSSN": 845,
      "VNQNAQALNTLVKQLSSN": 846,
      "PAY": 847,
      "GFNCYFPLQSYGF": 848,
      "TQLPPAY": 849,
      "LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIK": 850,
      "IADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNY": 851,
      "GFNCYFPLQSYGFQP": 852,
      "SASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQT": 853,
      "PFGEVFNATRFASVYAWNRKRISNCVADYSVLYN": 854,
      "PCNGV": 855,
      "LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKD": 856,
      "VNNSYECDIPIGAGICASYQTQTN": 857,
      "NTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSC": 858,
      "TRTQLPPAY": 859,
      "QPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIAD": 860,
      "ARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ": 861,
      "PFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQT": 862,
      "AIHVSG": 863,
      "GKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNY": 864,
      "EGFNCYFPLQSYGFQP": 865,
      "HVNNSYECDIPIGAGICASYQTQTN": 866,
      "HVNNSYECDIPIGAGICASYQTQTNS": 867,
      "EPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC": 868,
      "MFVFLVLLPLVSSQCVNL": 869,
      "SANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLV": 870,
      "LDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTD": 871,
      "NTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT": 872,
      "PFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNY": 873,
      "TNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSG": 874,
      "QPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAE": 875,
      "FGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTD": 876,
      "STEK": 877,
      "LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQ": 878,
      "TNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSGTNGTKRFDNPVLPFNDGVYFA": 879,
      "RYRLFRKSNLKPFERDISTEIYQAG": 880,
      "TNGV": 881,
      "RRR": 882,
      "TNGVGY": 883,
      "RDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC": 884,
      "SKPCNGV": 885,
      "VVNQNAQALNTLVKQLSSN": 886,
      "EGFNCYFPLQSYGFQPTNGVGY": 887,
      "RTRTQLPPAY": 888,
      "RYRLFRKSNLKPFERDISTEIYQAGSKPCNGV": 889,
      "HKNNKSWMES": 890,
      "HVNNSYECDIPIGAGICASYQTQTNSRRR": 891,
      "GVYS": 892,
      "RYRLFRKSNLKPFERDISTEIYQAGSKPCNGVEGFNCYFPLQSYGFQPTNGVGY": 893,
      "HKNNKSWMESGVYS": 894,
      "NVVNQNAQALNTLVKQLSSN": 895,
      "MFVFLVLLPLVSSQCVNLRTRTQLPPAY": 896,
      "HVNNSYECDIPIGAGICASYQTQTNSRRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ": 897,
      "VYY": 898,
      "STEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPF": 899,
      "PFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNYRYRLFRKSNLKPFERDISTEIYQAGSKPCNGVEGFNCYFPLQSYGFQPTNGVGY": 900,
      "FGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTDNTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT": 901,
      "HKNNKSWMESGVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLV": 902,
      "LDVYY": 903,
      "QPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAEHVNNSYECDIPIGAGICASYQTQTNSRRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ": 904,
      "LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQNVVNQNAQALNTLVKQLSSN": 905,
      "MFVFLVLLPLVSSQCVNLRTRTQLPPAYTNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSGTNGTKRFDNPVLPFNDGVYFA": 906,
      "PFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNYRYRLFRKSNLKPFERDISTEIYQAGSKPCNGVEGFNCYFPLQSYGFQPTNGVGYQPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAEHVNNSYECDIPIGAGICASYQTQTNSRRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ": 907,
      "XXXX": 908,
      "SEF": 909,
      "TYGV": 910,
      "SEFRVYS": 911,
      "HKNNKSWMESGVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLVRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC": 912,
      "HKNNKSWMESEFRVYS": 913,
      "STEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPFLDVYY": 914,
      "HRR": 915,
      "SIEK": 916,
      "LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQNVVNQNAQALNTLVKQLSSNFGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTDNTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT": 917,
      "FA": 918,
      "LYRLFRKSNLKPFERDISTEIYQAG": 919,
      "SIEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPF": 920,
      "STEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPFL": 921,
      "DVVNQNAQALNTLVKQLSSN": 922,
      "TPC": 923,
      "STPC": 924,
      "TYGVGY": 925,
      "LYRLFRKSNLKPFERDISTEIYQAGSTPC": 926,
      "HKNNKSWMESGVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLVRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLCPFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNYRYRLFRKSNLKPFERDISTEIYQAGSKPCNGVEGFNCYFPLQSYGFQPTNGVGYQPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAEHVNNSYECDIPIGAGICASYQTQTNSRRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ": 927,
      "NK": 928,
      "DVVN": 929,
      "SHRR": 930,
      "DVVNH": 931,
      "NAQALNTLVKQLSSK": 932,
      "MFVFLVLLPLVSSQCVNLRTRTQLPPAYTNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSGTNGTKRFDNPVLPFNDGVYFASIEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPF": 933,
      "SGTNGTKRFDNPVLPFNDGVYFA": 934,
      "DVVNHNAQALNTLVKQLSSK": 935,
      "GH": 936,
      "LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQDVVNQNAQALNTLVKQLSSN": 937,
      "RP": 938,
      "LTTRTQLPPAY": 939,
      "VNNSYECDIPIGAGICASYQTQTK": 940,
      "TYGVGH": 941,
      "RPTYGVGH": 942,
      "YVNNSYECDIPIGAGICASYQTQTK": 943,
      "NKPCNGV": 944,
      "LKRALTGIAVEQDKNTQEVFAQVKQIYKTPPIK": 945,
      "LKRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKY": 946,
      "YVNNSYECDIPIGAGICASYQTQTKSHRR": 947,
      "XXX": 948,
      "MFVFLVLLPLVSSQCVNLTTRTQLPPAY": 949,
      "HKNNKSWMESEFRVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLV": 950,
      "GNIADYNYKLPDDFTGCVIAWN": 951,
      "FKCYGVSPTKLNDLCFTNVYADSFVIR": 952,
      "TH": 953,
      "TNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAI": 954,
      "PFFA": 955,
      "FKCYGVSPTKLNDLCFTNVYADSFVIRGN": 956,
      "FGAISSVLNDIL": 957,
      "LYRLFRKSNLKPFERDISTEIYQAGSTPCNGV": 958,
      "ITR": 959,
      "ARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQLKRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKY": 960,
      "IDD": 961,
      "FGAISSVLNDILAR": 962,
      "GNIADYNYKLPDDFTGCVIAWNSNK": 963,
      "PFFAFKCYGVSPTKLNDLCFTNVYADSFVIRGN": 964,
      "PFD": 965,
      "LG": 966,
      "INFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ": 967,
      "PFFAFKCYGVSPTKLNDLCFTNVYADSFVIRGNEV": 968,
      "EGFNCYFPLQSYGFQPTYGVGY": 969,
      "HVNNSYECDIPIGAGICASYQTQTNSHRR": 970,
      "SQIAPGQT": 971,
      "QPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIDD": 972,
      "FGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQDVVNHNAQALNTLVKQLSSK": 973,
      "MFVFLVLLPLVSSQCVNLITR": 974,
      "TNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAISGTNGTKRFDNPVLPFNDGVYFA": 975,
      "GVY": 976,
      "NKPCNGVAG": 977,
      "LDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTH": 978,
      "YVNNSYECDIPIGAGICASYQTQTKSHRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQLKRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKY": 979,
      "LYRLFRKSNLKPFERDISTEIYQAGSTPCNGVEGFNCYFPLQSYGFQPTYGVGY": 980,
      "ARSVASQSIIAYTMSLGAENSVAYSNNSIAIPINFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ": 981,
      "MFVFLVLLPLVSSQCVNLRTRTQLPPAYTNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSGTNGTKRFDNPVLPFNDGVYFASTEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPFLDVYY": 982,
      "FGAISSVLNDILARLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTH": 983,
      "RPTYGVGHQPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAE": 984,
      "PFFAFKCYGVSPTKLNDLCFTNVYADSFVIRGNEVSQIAPGQT": 985,
      "LGVYY": 986,
      "HVNNSYECDIPIGAGICASYQTQTNSHRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPINFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ": 987,
      "LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQNVVNQNAQALNTLVKQLSSNFGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTD": 988,
      "LYRLFRKSNLKPFERDISTEIYQAGSTPCNGVEGFNCYFPLQSYGFQPTYGVGYQPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIDD": 989,
      "MFVFLVLLPLVSSQCVNLITRTQ": 990,
      "FAPFFAFKCYGVSPTKLNDLCFTNVYADSFVIRGNEVSQIAPGQT": 991,
      "TNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSGTNGTKRFDNPVLPFNDGVYFASTEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPFLDVYY": 992,
      "PFDEVFNATRFASVYAWNRKRISNCVADYSVLYN": 993,
      "NKPCNGVAGFN": 994,
      "PFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNYLYRLFRKSNLKPFERDISTEIYQAGSTPCNGVEGFNCYFPLQSYGFQPTYGVGYQPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIDD": 995,
      "STEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPFLGVY": 996,
      "TTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAEHVNNSYECDIPIGAGICASYQTQTNSHRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPINFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ": 997,
      "SANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLG": 998,
      "HKNNKSWMESGVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLVRDLPQGFSAL": 999,
      "CYFPL": 1000,
      "CYFPLRSY": 1001,
      "LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQDVVNQNAQALNTLVKQLSSNFGAISSVLNDILARLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTH": 1002,
      "STEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPFLGVYY": 1003,
      "YVNNSYECDIPIGAGICASYQTQTKSHRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQLKRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKYFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQDVVNHNAQALNTLVKQLSSK": 1004,
      "MFVFLVLLPLVSSQCVNLITRTQSY": 1005,
      "HKNNKSWMESEFRVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLG": 1006,
      "MFVFLVLLPLVSSQCVNLRTRTQLPPAYTNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSGTNGTKRFDNPVLPFNDGVYFASIEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPFLDVYY": 1007,
      "NKPCNGVAGFNCYFPLRSY": 1008,
      "MFVFLVLLPLVSSQCVNLTTRTQLPPAYTNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAISGTNGTKRFDNPVLPFNDGVYFA": 1009,
      "SVL": 1010,
      "FAPFFAFKCYGVSPTKLNDLCFTNVYADSFVIRGNEVSQIAPGQTGNIADYNYKLPDDFTGCVIAWNSNK": 1011,
      "PFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNYRYRLFRKSNLKPFERDISTEIYQAGSKPCNGVEGFNCYFPLQSYGFQPTNGVGYQPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAEHVNNSYECDIPIGAGICASYQTQTNSRRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQLNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQNVVNQNAQALNTLVKQLSSNFGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTDNTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT": 1012,
      "HKNNKSWMESEFRVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLVRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC": 1013,
      "RDLPQGFSVL": 1014,
      "HKNNKSWMESGVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLVRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLCPFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNYRYRLFRKSNLKPFERDISTEIYQAGSKPCNGVEGFNCYFPLQSYGFQPTNGVGY": 1015,
      "RDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLCPFDEVFNATRFASVYAWNRKRISNCVADYSVLYN": 1016,
      "LYRLFRKSNLKPFERDISTEIYQAGNKPCNGVAGFNCYFPLRSY": 1017,
      "RPTYGVGHQPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAEYVNNSYECDIPIGAGICASYQTQTKSHRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQLKRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKYFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQDVVNHNAQALNTLVKQLSSK": 1018,
      "NVVNQNAQALNTLVKQLSSNFGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTDNTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT": 1019,
      "PFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNYLYRLFRKSNLKPFERDISTEIYQAGSTPCNGVEGFNCYFPLQSYGFQPTYGVGYQPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIDDTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAEHVNNSYECDIPIGAGICASYQTQTNSHRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPINFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ": 1020,
      "LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQDVVNQNAQALNTLVKQLSSNFGAISSVLNDILARLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTHNTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT": 1021,
      "TDNTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT": 1022,
      "MFVFLVLLPLVSSQCVNLTTRTQLPPAYTNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAISGTNGTKRFDNPVLPFNDGVYFASTEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPFLGVY": 1023,
      "HKNNKSWMESGVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLVRDLPQGFSVL": 1024,
      "LVRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC": 1025,
      "LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQNVVNQNAQALNTLVKQLSSNFGAISSVLNDILSR": 1026,
      "HKNNKSWMESEFRVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLGRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLCPFDEVFNATRFASVYAWNRKRISNCVADYSVLYN": 1027,
      "STEKSNIIRGWIFGTTLDSK": 1028,
      "ASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT": 1029,
      "WYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT": 1030,
      "FAPFFAFKCYGVSPTKLNDLCFTNVYADSFVIRGNEVSQIAPGQTGNIADYNYKLPDDFTGCVIAWNSNKLDSKVGGNYNY": 1031,
      "LX": 1032,
      "LYRLFRKSNLKPFERDISTEIYQAGNKPCNGVAGFNCYFPLRSYGF": 1033,
      "IADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAE": 1034,
      "EPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITD": 1035,
      "MFVFLVLLPLVSSQCVNLITRTQSYTNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSGTNGTKRFDNPVLPFNDGVYFASTEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPFLDVYY": 1036,
      "MFVFLVLLPLVSSQCVNLRTRTQLPPAYTNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSGTNGTKRFDNPVLPFNDGVYFASTEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPFLGVYY": 1037,
      "LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLT": 1038,
      "AIHVSGTNGTKRFDNPVLPFNDGVYFA": 1039,
      "HKNNKSWMESGVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLVRDLPQGFSVLEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC": 1040,
      "NTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWP": 1041,
      "QPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAEHVNNSYECDIPIGAGICASYQTQTNSRRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQLNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQNVVNQNAQALNTLVKQLSSNFGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTDNTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT": 1042,
      "RPTYGVGHQPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAEYVNNSYECDIPIGAGICASYQTQTKSHRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQLKRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKYFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQDVVNHNAQALNTLVKQLSSKFGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTDNTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT": 1043,
      "SANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLVRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC": 1044,
      "XVVNQNAQALNTLVKQLSSN": 1045,
      "XXXXXXXX": 1046,
      "NYNY": 1047,
      "HVNNSYECDIPIGAGICASYQTQTNSRRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQLNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQNVVNQNAQALNTLVKQLSSNFGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTDNTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT": 1048,
      "HKNNKSWMESGVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLVRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLCPFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNYRYRLFRKSNLKPFERDISTEIYQAGSKPCNGVEGFNCYFPLQSYGFQPTNGVGYQPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAEHVNNSYECDIPIGAGICASYQTQTNSRRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQLNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQNVVNQNAQALNTLVKQLSSNFGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTDNTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT": 1049,
      "RDLPQGFSALEPLVDLPIGINITRFQTLLALHRSY": 1050,
      "QPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLY": 1051,
      "LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLAD": 1052,
      "HKNNKSWMESEFRVYSSANNCTFEYVSQPFLMDLEGKQ": 1053,
      "LRTRTQLPPAY": 1054,
      "MSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIIT": 1055,
      "SIEKSNIIRGWIFGTTLDSKTQSLLIVNNATNVVIKVCEFQFCNDPFLDVYY": 1056,
      "SPRR": 1057,
      "NTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASV": 1058,
      "VYS": 1059,
      "LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQXVVNQNAQALNTLVKQLSSN": 1060,
      "HKNNKSWMESEFRVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLGRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLCPFDEVFNATRFASVYAWNRKRISNCVADYSVLYNFAPFFAFKCYGVSPTKLNDLCFTNVYADSFVIRGNEVSQIAPGQTGNIADYNYKLPDDFTGCVIAWNSNKLDSKVGGNYNY": 1061,
      "HKNNKSWMESGVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLVRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLCPFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNYRYRLFRKSNLKPFERDISTEIYQAGSKPCNGVEGFNCYFPLQSYGFQPTNGVGYQPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAE": 1062,
      "TQSLLIVNNATNVVIKVCEFQFCN": 1063,
      "VLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQNVVNQNAQALNTLVKQLSSNFGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTDNTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT": 1064,
      "MFVFLVLLPLVSSQCVNLRTRTQLPPAYTNSFTRGVYYPDKVFRSSVLHSTQDLFLPFFSNVTWFHAIHVSG": 1065,
      "GNFKNLREFVFKNIDGYFKIYSKHTPINLVRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSYLTPGDSSSGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC": 1066,
      "PFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNYRYRLFRKSNLKPFERDISTEIYQAGSKPCNGVEGFNCYFPLQSYGFQPTNGVGYQPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIADTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAEHVNNSYECDIPIGAGICASYQTQTNSRRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQLNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQNVVNQNAQALNTLVKQLSSNFGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTD": 1067,
      "LNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQNVVNQNAQALNTLVKQLSSNFGAISSVLNDILSRLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFT": 1068,
      "NTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSE": 1069,
      "PFGEVFNATRFASVYAWNRKRISNCVADYSVLYNSASFSTFKCYGVSPTKLNDLCFTNVYADSFVIRGDEVRQIAPGQTGKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNYLYRLFRKSNLKPFERDISTEIYQAGSTPCNGVEGFNCYFPLQSYGFQPTYGVGYQPYRVVVLSFELLHAPATVCGPKKSTNLVKNKCVNFNFNGLTGTGVLTESNKKFLPFQQFGRDIDDTTDAVRDPQTLEILDITPCSFGGVSVITPGTNTSNQVAVLYQGVNCTEVPVAIHADQLTPTWRVYSTGSNVFQTRAGCLIGAEHVNNSYECDIPIGAGICASYQTQTNSHRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPINFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQLNRALTGIAVEQDKNTQEVFAQVKQIYKTPPIKDFGGFNFSQILPDPSKPSKRSFIEDLLFNKVTLADAGFIKQYGDCLGDIAARDLICAQKFNGLTVLPPLLTDEMIAQYTSALLAGTITSGWTFGAGAALQIPFAMQMAYRFNGIGVTQNVLYENQKLIANQFNSAIGKIQDSLSSTASALGKLQDVVNQNAQALNTLVKQLSSNFGAISSVLNDILARLDKVEAEVQIDRLITGRLQSLQTYVTQQLIRAAEIRASANLAATKMSECVLGQSKRVDFCGKGYHLMSFPQSAPHGVVFLHVTYVPAQEKNFTTAPAICHDGKAHFPREGVFVSNGTHWFVTQRNFYEPQIITTHNTFVSGNCDVVIGIVNNTVYDPLQPELDSFKEELDKYFKNHTSPDVDLGDISGINASVVNIQKEIDRLNEVAKNLNESLIDLQELGKYEQYIKWPWYIWLGFIAGLIAIVMVTIMLCCMTSCCSCLKGCCSCGSCCKFDEDDSEPVLKGVKLHYT": 1070,
      "EVFNATTF": 1071,
      "GKIADYNYKLPDDFTGCVIAWNSNNLDSKVGGNYNYRYRLFRKSNLKPFERDISTEIYQAGSKPCNGVEGFNCYFPLQSYGFQPTNGVGY": 1072,
      "NGVK": 1073,
      "SKLKPFERDISTEIYQAG": 1074,
      "RRRARSVASQSIIAYTMSLGAENSVAYSNNSIAIPTNFTISVTTEILPVSMTKTSVDCTMYICGDSTECSNLLLQYGSFCTQ": 1075,
      "NGVKGFNCYFPLQSYGFQP": 1076,
      "SGWTAGAAAYYVGYLQPRTFLLKYNENGTITDAVDCALDPLSETKCTLKSFTVEKGIYQTSNFRVQPTESIVRFPNITNLC": 1077,
      "FVFKNIDGYFKIYSKHTPIN": 1078,
      "HKNNKSWMESGVYSSANNCTFEYVSQPFLMDLEGKQGNFKNLREFVFKNIDGYFKIYSKHTPINLVRDLPQGFSALEPLVDLPIGINITRFQTLLALHRSY": 1079,
